tugas-eas/sysbench/point_select_run_100_1.log
sysbench 1.0.18 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 100
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 100 tps: 9214.81 qps: 9214.81 (r/w/o: 9214.81/0.00/0.00) lat (ms,95%): 18.95 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 100 tps: 9325.18 qps: 9325.18 (r/w/o: 9325.18/0.00/0.00) lat (ms,95%): 18.95 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 100 tps: 9049.35 qps: 9049.35 (r/w/o: 9049.35/0.00/0.00) lat (ms,95%): 19.65 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 100 tps: 8193.67 qps: 8193.77 (r/w/o: 8193.77/0.00/0.00) lat (ms,95%): 23.52 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 100 tps: 8197.60 qps: 8197.60 (r/w/o: 8197.60/0.00/0.00) lat (ms,95%): 23.52 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 100 tps: 7708.20 qps: 7708.10 (r/w/o: 7708.10/0.00/0.00) lat (ms,95%): 26.20 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 100 tps: 5610.10 qps: 5610.10 (r/w/o: 5610.10/0.00/0.00) lat (ms,95%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 100 tps: 5096.16 qps: 5096.16 (r/w/o: 5096.16/0.00/0.00) lat (ms,95%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 100 tps: 6129.03 qps: 6129.03 (r/w/o: 6129.03/0.00/0.00) lat (ms,95%): 31.37 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 100 tps: 8712.36 qps: 8712.36 (r/w/o: 8712.36/0.00/0.00) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 100 tps: 9125.62 qps: 9125.62 (r/w/o: 9125.62/0.00/0.00) lat (ms,95%): 19.29 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 100 tps: 8966.40 qps: 8966.40 (r/w/o: 8966.40/0.00/0.00) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 100 tps: 8823.31 qps: 8823.31 (r/w/o: 8823.31/0.00/0.00) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 100 tps: 8537.67 qps: 8537.67 (r/w/o: 8537.67/0.00/0.00) lat (ms,95%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 100 tps: 7710.58 qps: 7710.58 (r/w/o: 7710.58/0.00/0.00) lat (ms,95%): 24.83 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 100 tps: 6794.51 qps: 6794.51 (r/w/o: 6794.51/0.00/0.00) lat (ms,95%): 30.26 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 100 tps: 6365.96 qps: 6365.96 (r/w/o: 6365.96/0.00/0.00) lat (ms,95%): 29.72 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 100 tps: 6615.86 qps: 6615.86 (r/w/o: 6615.86/0.00/0.00) lat (ms,95%): 31.37 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 100 tps: 7849.47 qps: 7849.47 (r/w/o: 7849.47/0.00/0.00) lat (ms,95%): 23.95 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 100 tps: 8280.82 qps: 8280.82 (r/w/o: 8280.82/0.00/0.00) lat (ms,95%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 100 tps: 8112.61 qps: 8112.61 (r/w/o: 8112.61/0.00/0.00) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 100 tps: 8330.48 qps: 8330.48 (r/w/o: 8330.48/0.00/0.00) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 100 tps: 7260.03 qps: 7260.03 (r/w/o: 7260.03/0.00/0.00) lat (ms,95%): 27.17 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 100 tps: 6684.78 qps: 6684.78 (r/w/o: 6684.78/0.00/0.00) lat (ms,95%): 29.19 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 100 tps: 7306.91 qps: 7306.91 (r/w/o: 7306.91/0.00/0.00) lat (ms,95%): 25.74 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 100 tps: 5737.30 qps: 5737.30 (r/w/o: 5737.30/0.00/0.00) lat (ms,95%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 100 tps: 7764.32 qps: 7764.32 (r/w/o: 7764.32/0.00/0.00) lat (ms,95%): 24.83 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 100 tps: 8153.98 qps: 8153.98 (r/w/o: 8153.98/0.00/0.00) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 100 tps: 8675.58 qps: 8675.58 (r/w/o: 8675.58/0.00/0.00) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 100 tps: 7932.95 qps: 7932.95 (r/w/o: 7932.95/0.00/0.00) lat (ms,95%): 23.52 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            2322807
        write:                           0
        other:                           0
        total:                           2322807
    transactions:                        2322807 (7741.62 per sec.)
    queries:                             2322807 (7741.62 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0401s
    total number of events:              2322807

Latency (ms):
         min:                                    0.59
         avg:                                   12.91
         max:                                  147.40
         95th percentile:                       25.28
         sum:                             29996286.63

Threads fairness:
    events (avg/stddev):           23228.0700/49.09
    execution time (avg/stddev):   299.9629/0.02