tugas-eas/sysbench/point_select_run_100_2.log
sysbench 1.0.18 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 100
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 100 tps: 8390.66 qps: 8390.66 (r/w/o: 8390.66/0.00/0.00) lat (ms,95%): 21.89 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 100 tps: 8334.35 qps: 8334.45 (r/w/o: 8334.45/0.00/0.00) lat (ms,95%): 22.28 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 100 tps: 5893.55 qps: 5893.45 (r/w/o: 5893.45/0.00/0.00) lat (ms,95%): 34.95 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 100 tps: 7508.09 qps: 7508.09 (r/w/o: 7508.09/0.00/0.00) lat (ms,95%): 26.20 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 100 tps: 7145.19 qps: 7145.19 (r/w/o: 7145.19/0.00/0.00) lat (ms,95%): 27.66 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 100 tps: 8651.11 qps: 8651.11 (r/w/o: 8651.11/0.00/0.00) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 100 tps: 8701.94 qps: 8701.94 (r/w/o: 8701.94/0.00/0.00) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 100 tps: 8671.22 qps: 8671.22 (r/w/o: 8671.22/0.00/0.00) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 100 tps: 8656.18 qps: 8656.18 (r/w/o: 8656.18/0.00/0.00) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 100 tps: 8681.99 qps: 8681.99 (r/w/o: 8681.99/0.00/0.00) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 100 tps: 8611.63 qps: 8611.63 (r/w/o: 8611.63/0.00/0.00) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 100 tps: 8544.17 qps: 8544.17 (r/w/o: 8544.17/0.00/0.00) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 100 tps: 8693.10 qps: 8693.10 (r/w/o: 8693.10/0.00/0.00) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 100 tps: 8670.10 qps: 8670.10 (r/w/o: 8670.10/0.00/0.00) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 100 tps: 8607.16 qps: 8607.16 (r/w/o: 8607.16/0.00/0.00) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 100 tps: 8595.08 qps: 8595.08 (r/w/o: 8595.08/0.00/0.00) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 100 tps: 8691.78 qps: 8691.78 (r/w/o: 8691.78/0.00/0.00) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 100 tps: 8534.95 qps: 8534.95 (r/w/o: 8534.95/0.00/0.00) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 100 tps: 8711.66 qps: 8711.66 (r/w/o: 8711.66/0.00/0.00) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 100 tps: 8712.77 qps: 8712.77 (r/w/o: 8712.77/0.00/0.00) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 100 tps: 8621.51 qps: 8621.51 (r/w/o: 8621.51/0.00/0.00) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 100 tps: 8597.36 qps: 8597.36 (r/w/o: 8597.36/0.00/0.00) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 100 tps: 8543.76 qps: 8543.76 (r/w/o: 8543.76/0.00/0.00) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 100 tps: 8738.33 qps: 8738.33 (r/w/o: 8738.33/0.00/0.00) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 100 tps: 8722.42 qps: 8722.42 (r/w/o: 8722.42/0.00/0.00) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 100 tps: 8831.56 qps: 8831.56 (r/w/o: 8831.56/0.00/0.00) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 100 tps: 8810.89 qps: 8810.89 (r/w/o: 8810.89/0.00/0.00) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 100 tps: 8790.24 qps: 8790.24 (r/w/o: 8790.24/0.00/0.00) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 100 tps: 8383.85 qps: 8383.85 (r/w/o: 8383.85/0.00/0.00) lat (ms,95%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 100 tps: 8701.53 qps: 8701.53 (r/w/o: 8701.53/0.00/0.00) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            2537554
        write:                           0
        other:                           0
        total:                           2537554
    transactions:                        2537554 (8456.82 per sec.)
    queries:                             2537554 (8456.82 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0584s
    total number of events:              2537554

Latency (ms):
         min:                                    0.55
         avg:                                   11.82
         max:                                  173.52
         95th percentile:                       21.50
         sum:                             29997462.63

Threads fairness:
    events (avg/stddev):           25375.5400/56.34
    execution time (avg/stddev):   299.9746/0.00