tugas-eas/sysbench/point_select_run_100_3.log
sysbench 1.0.18 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 100
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 100 tps: 9023.65 qps: 9023.65 (r/w/o: 9023.65/0.00/0.00) lat (ms,95%): 19.29 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 100 tps: 9271.26 qps: 9271.26 (r/w/o: 9271.26/0.00/0.00) lat (ms,95%): 18.95 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 100 tps: 8976.29 qps: 8976.29 (r/w/o: 8976.29/0.00/0.00) lat (ms,95%): 19.65 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 100 tps: 8935.00 qps: 8935.00 (r/w/o: 8935.00/0.00/0.00) lat (ms,95%): 19.29 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 100 tps: 9372.61 qps: 9372.61 (r/w/o: 9372.61/0.00/0.00) lat (ms,95%): 18.61 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 100 tps: 8988.05 qps: 8988.05 (r/w/o: 8988.05/0.00/0.00) lat (ms,95%): 19.29 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 100 tps: 9138.16 qps: 9138.16 (r/w/o: 9138.16/0.00/0.00) lat (ms,95%): 18.95 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 100 tps: 9460.40 qps: 9460.40 (r/w/o: 9460.40/0.00/0.00) lat (ms,95%): 18.61 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 100 tps: 9361.49 qps: 9361.49 (r/w/o: 9361.49/0.00/0.00) lat (ms,95%): 18.61 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 100 tps: 9450.68 qps: 9450.68 (r/w/o: 9450.68/0.00/0.00) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 100 tps: 9491.40 qps: 9491.40 (r/w/o: 9491.40/0.00/0.00) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 100 tps: 9482.03 qps: 9482.03 (r/w/o: 9482.03/0.00/0.00) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 100 tps: 9309.82 qps: 9309.82 (r/w/o: 9309.82/0.00/0.00) lat (ms,95%): 18.61 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 100 tps: 9462.99 qps: 9462.99 (r/w/o: 9462.99/0.00/0.00) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 100 tps: 9322.46 qps: 9322.46 (r/w/o: 9322.46/0.00/0.00) lat (ms,95%): 18.61 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 100 tps: 9331.66 qps: 9331.76 (r/w/o: 9331.76/0.00/0.00) lat (ms,95%): 18.61 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 100 tps: 9333.63 qps: 9333.53 (r/w/o: 9333.53/0.00/0.00) lat (ms,95%): 18.95 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 100 tps: 8891.35 qps: 8891.35 (r/w/o: 8891.35/0.00/0.00) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 100 tps: 9210.03 qps: 9210.03 (r/w/o: 9210.03/0.00/0.00) lat (ms,95%): 18.95 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 100 tps: 9360.60 qps: 9360.60 (r/w/o: 9360.60/0.00/0.00) lat (ms,95%): 18.95 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 100 tps: 9313.39 qps: 9313.39 (r/w/o: 9313.39/0.00/0.00) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 100 tps: 9272.51 qps: 9272.51 (r/w/o: 9272.51/0.00/0.00) lat (ms,95%): 18.95 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 100 tps: 9183.29 qps: 9183.29 (r/w/o: 9183.29/0.00/0.00) lat (ms,95%): 18.95 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 100 tps: 9187.72 qps: 9187.72 (r/w/o: 9187.72/0.00/0.00) lat (ms,95%): 19.29 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 100 tps: 9112.62 qps: 9112.62 (r/w/o: 9112.62/0.00/0.00) lat (ms,95%): 19.29 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 100 tps: 9185.04 qps: 9185.04 (r/w/o: 9185.04/0.00/0.00) lat (ms,95%): 19.29 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 100 tps: 9267.95 qps: 9267.95 (r/w/o: 9267.95/0.00/0.00) lat (ms,95%): 18.61 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 100 tps: 9300.47 qps: 9300.47 (r/w/o: 9300.47/0.00/0.00) lat (ms,95%): 18.95 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 100 tps: 9014.45 qps: 9014.45 (r/w/o: 9014.45/0.00/0.00) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            2770945
        write:                           0
        other:                           0
        total:                           2770945
    transactions:                        2770945 (9235.65 per sec.)
    queries:                             2770945 (9235.65 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0259s
    total number of events:              2770945

Latency (ms):
         min:                                    0.54
         avg:                                   10.82
         max:                                   67.40
         95th percentile:                       18.95
         sum:                             29990636.22

Threads fairness:
    events (avg/stddev):           27709.4500/57.30
    execution time (avg/stddev):   299.9064/0.04